assignment1/benchmarks/openstack/disk_benchmark_randwrite_2017-06-15:06:59:39.out
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randwrite: (groupid=0, jobs=4): err= 0: pid=27379: Thu Jun 15 07:05:38 2017
  write: io=262144KB, bw=6723.2KB/s, iops=1680, runt= 38992msec
    clat (usec): min=4, max=131615, avg=2343.66, stdev=13186.46
     lat (usec): min=4, max=131616, avg=2344.11, stdev=13186.48
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    7], 90.00th=[   10], 95.00th=[ 1352],
     | 99.00th=[83456], 99.50th=[87552], 99.90th=[99840], 99.95th=[116224],
     | 99.99th=[130560]
    bw (KB  /s): min=  183, max=14484, per=25.13%, avg=1689.62, stdev=1444.72
    lat (usec) : 10=89.65%, 20=4.07%, 50=0.90%, 100=0.20%, 250=0.02%
    lat (usec) : 500=0.02%, 750=0.06%, 1000=0.02%
    lat (msec) : 2=0.23%, 4=0.47%, 10=0.98%, 20=0.56%, 50=0.21%
    lat (msec) : 100=2.51%, 250=0.10%
  cpu          : usr=0.07%, sys=0.35%, ctx=5116, majf=0, minf=41
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=262144KB, aggrb=6723KB/s, minb=6723KB/s, maxb=6723KB/s, mint=38992msec, maxt=38992msec

Disk stats (read/write):
  vda: ios=1/42649, merge=0/7794, ticks=0/229752, in_queue=229732, util=99.21%