assignment1/benchmarks/openstack/disk_benchmark_read_2017-06-14:16:26:53.out
read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
[...]

read: (groupid=0, jobs=4): err= 0: pid=1424: Wed Jun 14 16:28:10 2017
  read : io=262144KB, bw=30674KB/s, iops=7668, runt=  8546msec
    clat (usec): min=0, max=149692, avg=511.34, stdev=5956.86
     lat (usec): min=1, max=149692, avg=511.55, stdev=5956.86
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    2],
     | 99.00th=[   60], 99.50th=[53504], 99.90th=[86528], 99.95th=[104960],
     | 99.99th=[136192]
    bw (KB  /s): min= 4031, max= 9534, per=25.34%, avg=7772.54, stdev=1128.71
    lat (usec) : 2=44.75%, 4=52.88%, 10=0.43%, 20=0.24%, 50=0.61%
    lat (usec) : 100=0.20%, 250=0.01%, 500=0.03%, 750=0.03%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 50=0.21%, 100=0.54%, 250=0.06%
  cpu          : usr=0.13%, sys=0.58%, ctx=667, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=65536/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=30674KB/s, minb=30674KB/s, maxb=30674KB/s, mint=8546msec, maxt=8546msec

Disk stats (read/write):
  vda: ios=1029/6, merge=0/3, ticks=65616/500, in_queue=66204, util=98.80%