assignment1/benchmarks/openstack/disk_benchmark_read_2017-06-15:06:59:39.out
read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
[...]

read: (groupid=0, jobs=4): err= 0: pid=27351: Thu Jun 15 07:00:40 2017
  read : io=262144KB, bw=60305KB/s, iops=15076, runt=  4347msec
    clat (usec): min=0, max=80640, avg=260.59, stdev=3111.04
     lat (usec): min=1, max=80640, avg=260.81, stdev=3111.04
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    3], 90.00th=[    7], 95.00th=[   10],
     | 99.00th=[   56], 99.50th=[25984], 99.90th=[48384], 99.95th=[55552],
     | 99.99th=[71168]
    bw (KB  /s): min=12331, max=17929, per=24.91%, avg=15019.94, stdev=1627.99
    lat (usec) : 2=37.97%, 4=44.38%, 10=12.45%, 20=3.43%, 50=0.61%
    lat (usec) : 100=0.27%, 250=0.02%, 500=0.02%, 750=0.03%
    lat (msec) : 2=0.02%, 4=0.01%, 10=0.01%, 20=0.16%, 50=0.54%
    lat (msec) : 100=0.09%
  cpu          : usr=0.47%, sys=1.37%, ctx=657, majf=1, minf=49
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=65536/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=60304KB/s, minb=60304KB/s, maxb=60304KB/s, mint=4347msec, maxt=4347msec

Disk stats (read/write):
  vda: ios=1037/0, merge=0/0, ticks=33248/0, in_queue=33256, util=97.60%