assignment1/benchmarks/openstack/disk_benchmark_readwrite_2017-06-14:16:26:53.out
readwrite: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

readwrite: (groupid=0, jobs=4): err= 0: pid=1439: Wed Jun 14 16:28:34 2017
  read : io=130880KB, bw=17210KB/s, iops=4302, runt=  7605msec
    clat (usec): min=0, max=529009, avg=479.26, stdev=9951.02
     lat (usec): min=1, max=529010, avg=479.49, stdev=9951.01
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    2],
     | 99.00th=[   43], 99.50th=[37632], 99.90th=[71168], 99.95th=[102912],
     | 99.99th=[501760]
    bw (KB  /s): min= 1852, max= 8143, per=26.48%, avg=4556.95, stdev=1420.31
  write: io=131264KB, bw=17260KB/s, iops=4315, runt=  7605msec
    clat (usec): min=2, max=484569, avg=399.90, stdev=8609.88
     lat (usec): min=2, max=484569, avg=400.17, stdev=8609.88
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[   11], 99.50th=[34560], 99.90th=[68096], 99.95th=[89600],
     | 99.99th=[436224]
    bw (KB  /s): min= 1756, max= 8532, per=26.46%, avg=4567.31, stdev=1400.94
    lat (usec) : 2=24.78%, 4=62.89%, 10=10.87%, 20=0.26%, 50=0.52%
    lat (usec) : 100=0.12%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 20=0.01%, 50=0.22%, 100=0.28%
    lat (msec) : 250=0.01%, 500=0.03%, 750=0.01%
  cpu          : usr=0.40%, sys=0.58%, ctx=398, majf=0, minf=48
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32720/w=32816/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=130880KB, aggrb=17209KB/s, minb=17209KB/s, maxb=17209KB/s, mint=7605msec, maxt=7605msec
  WRITE: io=131264KB, aggrb=17260KB/s, minb=17260KB/s, maxb=17260KB/s, mint=7605msec, maxt=7605msec

Disk stats (read/write):
  vda: ios=529/135, merge=0/9, ticks=42772/31132, in_queue=76096, util=98.67%