assignment1/benchmarks/openstack/disk_benchmark_readwrite_2017-06-14:21:53:19.out
readwrite: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

readwrite: (groupid=0, jobs=4): err= 0: pid=1687: Wed Jun 14 21:54:51 2017
  read : io=130880KB, bw=15021KB/s, iops=3755, runt=  8713msec
    clat (usec): min=0, max=727469, avg=515.30, stdev=11290.20
     lat (usec): min=1, max=727470, avg=515.54, stdev=11290.20
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    3],
     | 99.00th=[   43], 99.50th=[37632], 99.90th=[87552], 99.95th=[144384],
     | 99.99th=[569344]
    bw (KB  /s): min=  854, max= 7656, per=27.00%, avg=4056.26, stdev=1890.51
  write: io=131264KB, bw=15065KB/s, iops=3766, runt=  8713msec
    clat (usec): min=2, max=609454, avg=490.24, stdev=10061.57
     lat (usec): min=2, max=609454, avg=490.50, stdev=10061.57
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[   16], 99.50th=[33024], 99.90th=[100864], 99.95th=[162816],
     | 99.99th=[428032]
    bw (KB  /s): min=  792, max= 8102, per=27.03%, avg=4072.08, stdev=1891.40
    lat (usec) : 2=21.63%, 4=59.10%, 10=17.72%, 20=0.28%, 50=0.59%
    lat (usec) : 100=0.11%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.17%
    lat (msec) : 100=0.27%, 250=0.05%, 500=0.03%, 750=0.01%
  cpu          : usr=0.24%, sys=0.67%, ctx=404, majf=0, minf=45
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32720/w=32816/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=130880KB, aggrb=15021KB/s, minb=15021KB/s, maxb=15021KB/s, mint=8713msec, maxt=8713msec
  WRITE: io=131264KB, aggrb=15065KB/s, minb=15065KB/s, maxb=15065KB/s, mint=8713msec, maxt=8713msec

Disk stats (read/write):
  vda: ios=524/139, merge=0/7, ticks=48420/41360, in_queue=91568, util=98.78%