assignment1/benchmarks/openstack/disk_benchmark_readwrite_2017-06-15:06:59:39.out
readwrite: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.10
Starting 4 processes
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

readwrite: (groupid=0, jobs=4): err= 0: pid=27365: Thu Jun 15 07:00:54 2017
  read : io=130880KB, bw=33362KB/s, iops=8340, runt=  3923msec
    clat (usec): min=0, max=418386, avg=317.81, stdev=6689.41
     lat (usec): min=1, max=418386, avg=318.04, stdev=6689.41
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    3],
     | 99.00th=[   44], 99.50th=[19328], 99.90th=[70144], 99.95th=[140288],
     | 99.99th=[374784]
    bw (KB  /s): min= 5181, max=16393, per=26.28%, avg=8767.25, stdev=2213.70
  write: io=131264KB, bw=33460KB/s, iops=8365, runt=  3923msec
    clat (usec): min=2, max=250330, avg=146.77, stdev=3349.68
     lat (usec): min=2, max=250330, avg=147.07, stdev=3349.68
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[   12], 99.50th=[ 1528], 99.90th=[37632], 99.95th=[56576],
     | 99.99th=[187392]
    bw (KB  /s): min= 4793, max=16196, per=26.47%, avg=8857.62, stdev=2317.97
    lat (usec) : 2=18.71%, 4=58.63%, 10=21.14%, 20=0.28%, 50=0.55%
    lat (usec) : 100=0.11%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.02%, 4=0.01%, 10=0.08%, 20=0.10%, 50=0.25%
    lat (msec) : 100=0.05%, 250=0.05%, 500=0.01%
  cpu          : usr=0.63%, sys=1.36%, ctx=399, majf=0, minf=45
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32720/w=32816/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=130880KB, aggrb=33362KB/s, minb=33362KB/s, maxb=33362KB/s, mint=3923msec, maxt=3923msec
  WRITE: io=131264KB, aggrb=33460KB/s, minb=33460KB/s, maxb=33460KB/s, mint=3923msec, maxt=3923msec

Disk stats (read/write):
  vda: ios=485/124, merge=0/7, ticks=23808/20720, in_queue=46808, util=97.17%